    [
    {
      "title": "Search Party",
      "director": "Scot Armstrong",
      "length": "1h 33m",
      "npaa rating": "R",
      "genre": "Comedy",
      "plot": "A pair of friends embark on a mission to reunite their pal with the woman he was going to marry."
  
    },
    {
      "title": "Bridesmaids",
      "director": "Paul Feig",
      "length": "2h 5m",
      "npaa rating": "R",
      "plot": "Competition between the maid of honor and a bridesmaid, over who is the bride's best friend, threatens to upend the life of an out-of-work pastry chef."
    },
    {
      "title": "Good Boys",
      "director": "Gene Stupnitsky",
      "length": "1h 30m",
      "npaa rating": "R",
      "genre": "Comedy",
      "plot": "Three 6th-grade boys ditch school and embark on an epic journey while carrying accidentally stolen drugs, being hunted by teenage girls, and trying to make their way home in time for a long-awaited party."
    },
    {
      "title": "Palm Springs",
      "director": "Max Barbakow",
      "length": "1h 30m",
      "npaa rating": "R",
      "genre": "Comedy",
      "plot":"Nyles and Sarah find themselves stuck in a time loop and living the same day over and over again. They are drawn to each other but certain revelations threaten their budding romance."
    }
    {
        "title": "The Hangover",
        "director": "Todd Phillips",
        "length": "1h 40m",
        "npaa rating":"R",
        "genre": "Comedy",
        "plot": "Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding."
      }
      {
        "title": "Booksmart",
        "director": "Olivia Wilde",
        "length": "1h 42m",
        "npaa rating": "R",
        "genre": "Comedy",
        "plot":"On the eve of their high-school graduation, two academic superstars and best friends realize they should have worked less and played more. Determined not to fall short of their peers, the girls try to cram four years of fun into one night."
      }
      {
        "title": "Superbad",
        "director": "Max Barbakow",
        "length": "1h 53m",
        "npaa rating": "R",
        "genre": "Comedy",
        "plot":"Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry."
      }
  ]